app/views/tasks/_form.html.erb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = ?  [["project_id", 1]]
---
    <!-- Responsable -->
    <%= f.select :user_id, @task.project.users.map{|u| [u.f_name, u.id]}, include_blank: true, label: 'Responsable' %>