app/views/users/_index_for_project.html.erb

SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = ?  [["project_id", 1]]
---
      <tbody>
        <% @project.users.each do |u| %>