app/views/users/show.html.erb

SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = ?  [["user_id", 2]]
---
			</thead>
		<% @user.projects.each do |p| %>