app/views/projects/_project.html.erb

	<div style="clear: both; padding-top:15px;">
	    <% @enterprise.projects.each do |project| %>
---
SELECT "projects".* FROM "projects"  WHERE "projects"."enterprise_id" = ?  [["enterprise_id", 1]]