app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    if current_user.super_admin
      @projects = Project.all

INSERT INTO "projects" ("created_at", "end_date", "enterprise_id", "name", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #Si tiene un archivo e input entonces
    if params[:project][:xml_file]
      @project_data = Project.new(project_params)
      file_upload = params[:project][:xml_file]
      # El path donde se va a guardar el archivo
      Dir.mkdir 'public/uploads' unless File.directory?('public/uploads')
      upload_path = Rails.root.join('public', 'uploads', file_upload.original_filename)
      # Si ya existe un archivo con el mismo nombre se crea con un número (i)
      if File.exist? upload_path.to_s
        i=1
        path = upload_path.to_s.insert(-4, "(#{i.to_s})")
        while File.exist? path do
          i = i+1
        end
        name = file_upload.original_filename.insert(-5, "(#{i.to_s})")

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def tree_view
    @project = Project.find(params[:project_id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_project
    @project = Project.find(params[:id])