app/controllers/project_users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_project_user
      @project_user = ProjectUser.find(params[:id])