app/controllers/tasks_controller.rb

SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = ?  [["project_id", 1]]
---
  def new
    # Creamos una tarea que tendra un proyecto, su padre y la fecha
    @task = Task.new(project_id: params[:project_id])

    # hay veces que se crean tareas de primer nivel por lo que no tienen parent_id, solo corresponden al proyecto.
    if params[:parent_id]
      @task.expected_start_date = Task.find(params[:parent_id]).expected_start_date
      @task.expected_end_date = Task.find(params[:parent_id]).expected_end_date
      @task.parent_id = params[:parent_id]
      @task.user_id = Task.find(params[:parent_id]).user_id

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_task
    if params[:id]
      @task = Task.find(params[:id])
      @project = @task.project

    # cuando es llamada desde otro controlador
    elsif params[:task_id]
      @task = Task.find(params[:task_id])