app/controllers/users_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = ?  [["project_id", 1]]
---
  def index
    @users = User.all.includes(:projects)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "encrypted_password", "enterprise_id", "last_name", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #se crea el objeto usuario asignandole los parametros recibidos del form.
    project_id = params[:user][:project_id]
    @user = User.new(user_params)
    # Si es creado desde un proyecto en particular, entonces se le asigna ese proyecto
    assign_project(project_id)
    @user.name = @user.name.camelize
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users"
---
  def show
    @users = User.all